#============================================= 声明并初始化 =============================================#

SET @name = '张三';

SET @name := '李四';

SELECT @name := 100;

SELECT `user_name` 
INTO @name
FROM `user`
WHERE `user_id` = 9;

SELECT `age` 
INTO @age
FROM `user`
WHERE `user_id` = 9;

#============================================= 查看变量 =============================================#
SELECT @name, @age;

#============================================= 运算 =============================================#

SET @num1 = 2;

SET @num2 = 3;

SET @sum = @num1 + @num2;

SELECT @sum;









